# Relatório de Análise II

## Tipos de Imóveis

In [1]:
import pandas as pd

In [2]:
dados = pd.read_csv("dados/aluguel.csv", sep = ";")

In [3]:
dados.head()

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU,Valor m2,Tipo Agregado
0,Apartamento,Centro,1,0,0,15,800.0,390.0,20.0,53.33,Apartamento
1,Apartamento,Higienópolis,1,0,0,48,800.0,230.0,0.0,16.67,Apartamento
2,Apartamento,Cachambi,2,0,0,50,1300.0,301.0,17.0,26.00,Apartamento
3,Apartamento,Grajaú,2,1,0,70,1500.0,642.0,74.0,21.43,Apartamento
4,Apartamento,Lins de Vasconcelos,3,1,1,90,1500.0,455.0,14.0,16.67,Apartamento

In [4]:
dados['Tipo']

0        Apartamento
1        Apartamento
2        Apartamento
3        Apartamento
4        Apartamento
            ...
19826      Quitinete
19827      Quitinete
19828      Quitinete
19829      Quitinete
19830      Quitinete
Name: Tipo, Length: 19831, dtype: object

In [5]:
dados.Tipo

0        Apartamento
1        Apartamento
2        Apartamento
3        Apartamento
4        Apartamento
            ...
19826      Quitinete
19827      Quitinete
19828      Quitinete
19829      Quitinete
19830      Quitinete
Name: Tipo, Length: 19831, dtype: object

In [6]:
tipo_de_imovel = dados['Tipo']

In [7]:
type(tipo_de_imovel)

pandas.core.series.Series

In [8]:
tipo_de_imovel.drop_duplicates()

0               Apartamento
16923                  Casa
17821    Casa de Condomínio
18785          Casa de Vila
19018             Quitinete
Name: Tipo, dtype: object

In [9]:
tipo_de_imovel

0        Apartamento
1        Apartamento
2        Apartamento
3        Apartamento
4        Apartamento
            ...
19826      Quitinete
19827      Quitinete
19828      Quitinete
19829      Quitinete
19830      Quitinete
Name: Tipo, Length: 19831, dtype: object

In [10]:
tipo_de_imovel.drop_duplicates(keep='first', inplace=False)
tipo_de_imovel.drop_duplicates(inplace = True)

In [11]:
tipo_de_imovel

0               Apartamento
16923                  Casa
17821    Casa de Condomínio
18785          Casa de Vila
19018             Quitinete
Name: Tipo, dtype: object

# Organizando a Visualização

In [12]:
tipo_de_imovel = pd.DataFrame(tipo_de_imovel)

In [13]:
tipo_de_imovel

                     Tipo
0             Apartamento
16923                Casa
17821  Casa de Condomínio
18785        Casa de Vila
19018           Quitinete

In [14]:
tipo_de_imovel.index

Int64Index([0, 16923, 17821, 18785, 19018], dtype='int64')

In [15]:
tipo_de_imovel.shape[0]

5

In [16]:
range(tipo_de_imovel.shape[0])

range(0, 5)

In [17]:
for i in range(tipo_de_imovel.shape[0]):
  print(i)

0
1
2
3
4

In [18]:
tipo_de_imovel.index = range(tipo_de_imovel.shape[0])

In [19]:
tipo_de_imovel.index

RangeIndex(start=0, stop=5, step=1)

In [20]:
tipo_de_imovel

                 Tipo
0         Apartamento
1                Casa
2  Casa de Condomínio
3        Casa de Vila
4           Quitinete

In [21]:
tipo_de_imovel.columns.name = "Id"

In [22]:
tipo_de_imovel

Id                Tipo
0          Apartamento
1                 Casa
2   Casa de Condomínio
3         Casa de Vila
4            Quitinete

In [44]:
lotofacil = pd.read_excel("loto_facil_asloterias_ate_concurso_2319_sorteio.xlsx")

In [45]:

lotofacil.to_csv (r'dados/teste.csv', index = None, header=True)

In [46]:
lotofacil.head()

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12,Unnamed: 13,Unnamed: 14,Unnamed: 15,Unnamed: 16
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [41]:
lotofacil.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2318 entries, 0 to 2317
Data columns (total 15 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   12      2318 non-null   int64
 1   16      2318 non-null   int64
 2   19      2318 non-null   int64
 3   23      2318 non-null   int64
 4   24      2318 non-null   int64
 5   17      2318 non-null   int64
 6   25      2318 non-null   int64
 7   15      2318 non-null   int64
 8   14      2318 non-null   int64
 9   2       2318 non-null   int64
 10  3       2318 non-null   int64
 11  8       2318 non-null   int64
 12  21      2318 non-null   int64
 13  13      2318 non-null   int64
 14  22      2318 non-null   int64
dtypes: int64(15)
memory usage: 271.8 KB

In [42]:
lotofacil.dtypes

12    int64
16    int64
19    int64
23    int64
24    int64
17    int64
25    int64
15    int64
14    int64
2     int64
3     int64
8     int64
21    int64
13    int64
22    int64
dtype: object

In [43]:
 lotofacil.value_counts()

12  16  19  23  24  17  25  15  14  2   3   8   21  13  22
1   2   7   13  11  25  14  8   15  19  20  9   17  24  23    1
18  16  9   1   20  11  23  17  22  2   3   24  8   4   25    1
    3   4   8   10  7   24  12  19  23  6   1   15  22  2     1
        7   23  17  24  21  1   8   14  5   22  16  2   12    1
        9   21  19  22  8   15  10  23  14  2   20  4   13    1
                                                             ..
9   15  13  6   7   24  10  25  14  22  3   2   16  17  21    1
        18  10  23  20  14  21  16  4   2   24  5   11  7     1
        25  14  16  2   8   11  12  7   1   22  4   23  18    1
    17  2   10  16  3   11  25  22  12  23  20  8   6   5     1
25  24  13  22  4   3   8   18  20  2   1   10  23  11  16    1
Length: 2318, dtype: int64